
# N-е число Трибоначчи.
# Последовательность Трибоначчи T n определяется следующим образом: 

# T_0 = 0,
# T_1 = 1,
# T_2 = 1 и (T_n+3) = (T_n) + (T_n+1) + (T_n+2) для n >= 0.

# Учитывая n, верните значение T n .

# Объяснение:
# Т_3 = 0 + 1 + 1 = 2
# Т_4 = 1 + 1 + 2 = 4
# Т_5 = 1 + 2 + 4 = 7

n = 5

dp = [0,1,1]

if n < 3:
    print(dp[n])
else:
    for i in range(3, n + 1):
        print(i)
        dp.append(dp[i-3] + dp[i-2] + dp[i-1])
        print(dp[i-3], dp[i-2], dp[i-1], ' = ', dp[-1])

    print(dp[-1])